---
kind: other
id: Properties.T:Autodesk.Revit.DB.PolylineSegments
source: html/36e5aef4-d3fa-048a-fb0f-5961d3c9dde9.htm
---
# PolylineSegments Properties

Local parameter associated with the end point.